Revit 2027 API
EnergyDataSettings.EnergyModel Property
 if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EnergyModel { get; set; }
Public Property EnergyModel As Boolean
	Get
	Set
public:
property bool EnergyModel {
	bool get ();
	void set (bool value);
}
member EnergyModel : bool with get, set
Property Value
Boolean
 true if energy model is on, false otherwise
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace